ab-dynamic
ab -c 10 -n 5000 http://messanger.std:8000/


This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking messanger.std (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        gunicorn/19.9.0
Server Hostname:        messanger.std
Server Port:            8000

Document Path:          /
Document Length:        56 bytes

Concurrency Level:      10
Time taken for tests:   1.467 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      940000 bytes
HTML transferred:       280000 bytes
Requests per second:    3407.26 [#/sec] (mean)
Time per request:       2.935 [ms] (mean)
Time per request:       0.293 [ms] (mean, across all concurrent requests)
Transfer rate:          625.55 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     0    3   0.6      3       6
Waiting:        0    3   0.6      3       6
Total:          1    3   0.6      3       6

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      3
  80%      3
  90%      4
  95%      4
  98%      5
  99%      5
 100%      6 (longest request)