ab-dynamic-proxy
ab -c 10 -n 5000 http://messanger.std/api


This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking messanger.std (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        nginx/1.14.0
Server Hostname:        messanger.std
Server Port:            80

Document Path:          /api
Document Length:        52 bytes

Concurrency Level:      10
Time taken for tests:   1.697 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      950000 bytes
HTML transferred:       260000 bytes
Requests per second:    2946.66 [#/sec] (mean)
Time per request:       3.394 [ms] (mean)
Time per request:       0.339 [ms] (mean, across all concurrent requests)
Transfer rate:          546.74 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     1    3   0.8      3      16
Waiting:        1    3   0.8      3      16
Total:          1    3   0.8      3      16

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      3
  80%      4
  90%      4
  95%      4
  98%      5
  99%      6
 100%     16 (longest request)